tap "thoughtbot/formulae"
tap "homebrew/services"
tap 'caskroom/cask'

# Casks
cask "java" unless system '/usr/libexec/java_home --failfast'
cask "virtualbox"
cask "alfred"
cask "firefox"
cask "google-chrome"
cask "screenhero"
cask "skitch"
cask "slack"
cask "iterm2"

# Extra
cask "flux"
cask "spectacle"
cask "karabiner"

# Unix
brew "git"
brew "openssl"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "vim", args: [ "override-system-vi" ]
brew "zsh"
brew "tmate"
brew "gcc"
brew "phantomjs"
brew "htop"
brew "watch"

# Docker
brew "docker"

# GitHub
brew "hub"

# Image manipulation
brew "imagemagick"

# Testing
brew "qt"

# Programming languages
brew "maven"
brew "nodenv"
brew "node-build"
brew "rbenv"
brew "ruby-build"

# Databases
brew "postgres", restart_service: true
brew "redis", restart_service: true
brew "rabbitmq", restart_service: true
brew "mongodq", restart_service: true
